---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsAXMImportLinkAvailable
source: html/66c70b07-0932-8a9d-5139-0c7e00eacc3e.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsAXMImportLinkAvailable Method

Checks whether the AXM Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsAXMImportLinkAvailable()
```

## Returns
True if the AXM Import/Link functionality is available in the installed Revit.

## Remarks
AXM Import/Link is optional functionality that does not have to be part of the Revit installation.